In [ ]:
print("Hello World")

In [ ]:
print("Ravi")
print("kumar")

In [ ]:
5//2

In [ ]:
5**4
4**5

In [ ]:
4%5

In [ ]:
4*5*3/2+5-2

In [ ]:
a=12
b=1.5
c=10
a+b+c

In [ ]:
a+c

In [ ]:
ab

In [ ]:
a/c*b

In [ ]:
c="hello world"
print("C")

In [ ]:
print(c)

In [ ]:
print c

In [ ]:
d='hello world'
print(d)

In [ ]:
"ravi's bike"

calculating tax@10%

In [ ]:
inc=15553
tax=inc*10/100
print(inc)

In [ ]:
print(tax)

Area of a Circle

In [ ]:
pi=3.14
r=4
area=pi*r**2
print("area: ", area)

rounding the number

In [ ]:
print((round(10.3456,2))

In [ ]:
print((round(10.3456,2)))

In [ ]:
print(int(area))

In [ ]:
print(float(area))

In [ ]:
a=20
print(a.bit_length)

In [ ]:
Mystory='I Don't like to eat cheese'
print(Mystory)

In [ ]:
mystory="I don't like pizzas'"
print(mystory)

In [ ]:
mystory='I don\'t like pizzas'
print(mystory)

In [ ]:
a="ravi"
b="kumar"
print(a+b)

In [ ]:
name=ravi
age=43
print('my name:{one} and my age is:{two}'.format(one=name,two=age))

In [ ]:
print('my name:{} and my age is:{}'.format(name,age))

In [ ]:
print(name)

In [ ]:
name="ravi"
age=35
print('my name:{} and my age is:{}'.format(name,age))

In [ ]:
print('my name:{} and my age is:{}'.format(name,age))

In [ ]:
print(name)

In [ ]:
name="ravi"
print(name)

In [ ]:
print(3*"hello")

In [ ]:
print(300*"hello "+"\n the end")

In [ ]:
print("hello"*3)

In [ ]:
name="ravi"
age=35
print(name,age)

In [ ]:
print('my name:{} and my age is:{}'.format(name,age))

In [ ]:
print('my name:{one} and my age is:{two}'.format(two=age,one=name))

In [ ]:
print("ravi".upper)

In [ ]:
print("ravi".upper())

In [ ]:
print("ravi".upper().len())

In [ ]:
print(len("ravi".upper())

In [ ]:
print(len("ravi".upper()))

In [ ]:
"hi my name is ravi".replace("ravi","kumar")

In [ ]:
"hi my name is ravi".replace("RAVI".lower(),"kumar")

In [ ]:
bob="hi my name is ravi"*50
bob.replace("Ravi".lower(),"Pavan")

In [ ]:

bob="hi my name is ravi \n"*50
print(bob.replace("Ravi".lower(),"Pavan"))

In [ ]:
print("ravi \n kumar")

In [ ]:
print(str("ravi",1,2))

In [ ]:
print(str("ravi","ra"))

In [ ]:
bob.split()

In [ ]:
"hi my name is ravi".split()

In [ ]:
bob="hi my name is ravi"
bob.find("name")

In [ ]:
print("ravi"=="Ravi".lower())

In [ ]:
print(2<>3)

In [ ]:
print(2==2 and 2>1)

In [ ]:
(3+2)>4 and (3+2)<6

In [ ]:
name=input("Enter your name \n")
print("my name is {}".format(name))

In [ ]:
pi=3.14
radius=input("Enter Radius: ")
Area=round(pi*int(radius)**2,0)
print("Area of Circle is {}".format(Area))

In [ ]:
sal=input("Enter your Salary: ")
tax=input("Enter tax %: ")
ttax=float(sal)*float(tax)/100
nsal=float(sal)-ttax
print("Net Salary is {}".format(nsal))

In [ ]:
a = float(input("Enter side A:"))
b = float(input("Enter side B:"))
c = float(input("Enter side C:"))
perm = (a+b+c)/2
area = math.sqrt((perm*(perm-a)(perm-b)(perm-c)))
print("Area is {} and Perimeter is {}".format(area,perm))

In [ ]:
var1=3
print('var1 is %1.2f' %(var1))

In [ ]:
print('var1 is ' + var1)

In [ ]:
print('addition of %s and %s is %s' %(10, 20, 10+20))

In [ ]:
print('Alone we can do little \n together we can do so much')

In [ ]:
print("Hello World"[7])

In [ ]:
print("Hello World"[-5])

In [ ]:
print("Hello World"[:7])

In [ ]:
var="Hello World"

In [ ]:
var.isalpha()

In [ ]:
[10,20,"ravi", "pavan"]

In [ ]:
z=[1,2,3]
z[0]

In [ ]:
x=[4,5,z]

In [ ]:
x[2,0]

In [ ]:
print x

In [ ]:
x=[1,2,[3,4,5]]
x[3:]

In [ ]:
x[2:]

In [ ]:
x[2,2]

In [ ]:
x[2][2]

In [ ]:
d=[{'r':"red"},{'g':"green"},{'y':"yellow"}]
d.keys()

In [ ]:
mylist = [1,2,3,"ravi"]
mylist = mylist + ['kumar']
print (mylist)

In [ ]:
print (mylist.reverse())

In [ ]:
print(mylist)

In [ ]:
mylist

In [ ]:
utlist=mylist
mylist.reverse()
mylist
utlist

In [ ]:
mylist

In [ ]:
utlist

In [ ]:
urlist=mylist

In [ ]:
mylist.reverse()

In [ ]:
mylist

In [ ]:
urlist

In [ ]:
mylist

In [ ]:
xlist=list(mylist)
mylist.reverse()
mylist
xlist

In [ ]:
mylist

In [ ]:
xlist

In [ ]:
mylist

In [ ]:
mylist[:]

In [ ]:
mylist[0:3]

In [ ]:
x=['kumar', 'ravi', [3, 2, 1]]
x[2][2]

In [ ]:
tup1=(1,2,3,4,5)
max(tup1)

In [ ]:
tup2=(1,1,1,1,1)
tup3=tup1+tup2
tup3

In [ ]:
len(tup3)

In [ ]:
>>> 1 in tup3

In [ ]:
>>> 6 in tup3

In [ ]:
set1={1,2,3}
set1{2}

In [ ]:
set1(2)

In [ ]:
set1={1,2,3}
set2={4,5}
set1.update(set2)
>>> set1

In [ ]:
>>>set1

In [ ]:
set1

In [ ]:
set2

In [ ]:
set2={3,4}

In [ ]:
set2

In [ ]:
set1.update(set2)

In [ ]:
set1

In [ ]:
{1,1,1,1,2,2,2,3,4,3}

In [ ]:
{5,3,4,2,1}

In [ ]:
s={5,3,4,2,1}
s

In [ ]:
dict1={'name':'ravi', 'age':40}
dict1.keys()

In [ ]:
s=set()
s.add(1)
s

In [ ]:
s.add(1)

In [ ]:
s

In [ ]:
s.add(2)
s

In [ ]:
x=False
if x:
    print('x was true')
else:
    print('x was false')

In [ ]:
Bank = 'SG'
if Bank=='ANZ':
    print ("My Bank is ", 'ANZ')
elif Bank=='HSBC':
        print ("My Bank is %s", 'HSBC')
elif Bank=='SBI':
     print ("My Bank is %s", 'SBI')
else:
    print ("My Bank is %s", Bank)

In [ ]:
sal=float(input("Enter Salary: "))
if sal>=10000 and sal<=20000:
    taxper = 3
elif sal >= 21000 and sal <= 30000:
    taxper = 5
elif sal >= 31000 and sal <= 50000:
    taxper = 10
else:
    taxper = 20
tax = sal*taxper/100
nsal = sal-tax
print("Net salary is %1.2f" % (nsal))

In [ ]:
import numpy as np
arr = np.arange(0,10)
arr

In [ ]:
arr + arr

In [ ]:
arr*arr

In [ ]:
arr/arr

In [ ]:
1/arr

In [ ]:
arr

In [ ]:
1/arr

In [ ]:
np.sqrt(arr)

In [ ]:
np.sqr(arr)

In [ ]:
np.max(arr)

In [ ]:
np.cos(Arr)

In [ ]:
np.cos(arr)

In [ ]:
np.arr**2

In [ ]:
arr**2

In [ ]:
np.log(arr)

In [ ]:
my_matrix = [[1,2,3],[4,5,6], [7,8,9]]
my_matrix

In [ ]:
np.array(my_matrix)

In [ ]:
np.arange(0,100,11)

In [ ]:
np.arange(10,0,-1)

In [ ]:
my_matrix[2][1]

In [ ]:
np.zeros(5)

In [ ]:
np.zeros((5,5))

In [ ]:
np.ones((3,3))

In [ ]:
np.ones((3,3))*3

In [ ]:
np.ones((3,3))+np.ones((3,3))*3

In [ ]:
np.ones((3,3))*2*np.ones((3,3))*3

In [ ]:
np.linspace(0,20,10)

In [ ]:
np.eye(5)

In [ ]:
np.random.rand(10)

In [ ]:
np.array_equal(np.ones((3,3)), np.ones((3,3))*3)

In [ ]:
np.array_equal(np.ones((3,3)), np.ones((3,3)))

In [ ]:
np.array2string

In [ ]:
np.random.randint(1,100,10)

In [ ]:
arr=np.arange(25)

In [ ]:
arr

In [ ]:
np.array((1,1),(2,2),(3,3))

In [ ]:
ranarr

In [ ]:
ranarr=np.random.rand(0,40,5)

In [ ]:
ranarr

In [ ]:
ranarr.max

In [ ]:
arr

In [ ]:
arr.shape

In [ ]:
arr.reshape(1,25)

In [ ]:
arr.dtype

In [ ]:
np.arange(10,51)

In [ ]:
import numpy as np

In [ ]:
my_matrix = [[0,1,2],[3,4,5], [6,7,8]]
np.array(my_matrix)

In [ ]:
np.arange(9).reshape(3,3)

In [ ]:
np.eye(3,3)

In [ ]:
np.random.randint(0,1)

In [ ]:
np.random.rand(0,1)

In [ ]:
np.random.rand(1)

In [ ]:
np.random.rand(0,25)

In [ ]:
np.random.rand(25)

In [ ]:
np.random.randn(25)

In [ ]:
np.array(0,1,0.1)

In [ ]:
np.random.rand(0,1,0.01)

In [ ]:
np.arange(1,101).reshape(10,10)/100

In [ ]:
np.arange(100).reshape(10,10)/100

In [ ]:
np.random.randint(0,1,10)

In [ ]:
np.random.rand(0,1,10)

In [ ]:
np.arange(0,1,20)

In [ ]:
np.arange(1,20)

In [ ]:
np.arange(0,1,0.05)

In [ ]:
np.linspace(0,1,5)

In [ ]:
mlist=np.arange(12,26)

In [ ]:
mlist=np.arange(12,26)
mlist

In [ ]:
del mlist[5]

In [ ]:
np.arange(1,26).reshape(5,5)

In [ ]:
np.arange(1,26).reshape(5,5)[1:]

In [ ]:
np.arange(1,26).reshape(5,5)[2:]

In [ ]:
np.arange(1,26).reshape(5,5)

In [ ]:
aaa=np.arange(1,26).reshape(5,5)
aaa[2:]

In [ ]:
aaa[2:,:2]

In [ ]:
aaa[2:,2:]

In [ ]:
aaa

In [ ]:
aaa[3,4]

In [ ]:
aaa[:3,1:2]

In [ ]:
aaa[4:,]

In [ ]:
aaa[3:,]

In [ ]:
aaa.sum()

In [ ]:
aaa.std()

In [ ]:
aaa.sum(3)

In [ ]:
sum(aaa)

In [ ]:
aaa.sum(axis=1)

In [ ]:
aaa.prod(axis=1)

In [ ]:
aaa.put(1,5,'raise')

In [ ]:
aaa

In [ ]:
aaa.put

In [ ]:
d={'a':10,'b':20,'c':30}

In [ ]:
d.items()

In [ ]:
d.values()

In [ ]:
d.keys()

In [ ]:
my_list = [10,20,30]

In [ ]:
import pandas as pd

In [ ]:
pd.Series(data=my_list)

In [ ]:
label = ['a','b','c']

In [ ]:
pd.Series(data=my_list,index=label)

In [ ]:
arr=np.array([10,20,30])

In [ ]:
arr

In [ ]:
pd.Series(arr)

In [ ]:
pd.Series(arr)[1]

In [ ]:
d

In [ ]:
pd.Series(d)

In [ ]:
pd.datetime(2018,6,6)

In [ ]:
pd.ExcelFile(C:\Users\Administrator\test.xlsx,xls)

In [ ]:
ser1 = pd.Series([1,2,3,4],index = [ 'USA', 'Germany', 'USSR', 'Japan'])

In [ ]:
ser1

In [ ]:
ser1['USA']

In [ ]:
ser2 = pd.Series([1,2,5,4],index = [ 'USA', 'Germany', 'Italy', 'Japan'])

In [ ]:
ser2

In [ ]:
ser1 + ser2

In [ ]:
ser1['USA']
ser2['USA']

In [ ]:
ser1['USA']

In [ ]:
from pandas import pd
from numpy.random import randn
np.random.seed(101)

In [ ]:
df = pd.DataFrame(np.arange(1,21).reshape(5,4),index='A B C D E'.split(), columns='W X Y Z'.split())

In [ ]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(), columns='W X Y Z'.split())

In [ ]:
df

In [ ]:
np.random.seed(105)

In [ ]:
df

In [ ]:
type(df['W'])

In [ ]:
df['new'] = df['W'] + df['X']

In [ ]:
df

In [ ]:
df['YZ'] = df['Y'] + df ['Z']

In [ ]:
df

In [ ]:
df['2X'] = df['X']*2

In [ ]:
df

In [ ]:
df.del['new']

In [ ]:
del(df['new'])

In [ ]:
df

In [ ]:
dfb = df

In [ ]:
del(df['A', 'B'])

In [ ]:
df['W','Z']

In [ ]:
dfb

In [ ]:
df

In [ ]:
df.drop('2X',axis=1)

In [ ]:
df

In [ ]:
df.drop(['YZ','2X'], axis=1,inplace=True)

In [ ]:
df

In [ ]:
df.drop('E',axis=0)

In [ ]:
df.loc['A']

In [ ]:
df.loc[['A','B'],['W','Y']]

In [ ]:
df

In [ ]:
df[df>0]

In [ ]:
df[df['W']>0]

In [ ]:
df[df['X']>1]

In [ ]:
df[df['X']>1][['Y','W']]

In [ ]:
df

In [ ]:
df[(df['W']>0) & (df['Y'] > 1)]

In [ ]:
df[(df['W']>0) | (df['Y'] > 1)]

In [ ]:
cntry = 'CA NY WY OR CO'.split()
df['States'] = cntry
df

In [ ]:
df.reset_index()

In [ ]:
df[0]

In [ ]:
df.loc(0)

In [ ]:
df['W']

In [ ]:
df

In [ ]:
dfb=df.reset_index()

In [ ]:
dfb

In [ ]:
dfb[0]

In [ ]:
df

In [ ]:
dfb.set_index('States',inplace=True)

In [ ]:
df

In [ ]:
dfb

In [ ]:
df

In [ ]:
dfb1= dfb.reset_index()

In [ ]:
dfb

In [ ]:
dfb1

In [ ]:
dfb1.set_index('index')['A']

In [ ]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [ ]:
hier_index

In [ ]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [ ]:
import numpy as np

In [ ]:
df

In [ ]:
df.loc['G1'].loc[1]

In [ ]:
df.loc['G2'].loc[2]

In [ ]:
df.index.names

In [ ]:
df.iloc[1]

In [ ]:
import pandas as pd
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        'Sales':[200,120,340,124,243,350]}

In [ ]:
df = pd.DataFrame(data)

In [ ]:
df

In [ ]:
df.groupby('Company')

In [ ]:
df

In [ ]:
by_comp = df.groupby('Company')

In [ ]:
by_comp

In [ ]:
by_comp.mean()

In [ ]:
by_comp.sum()

In [ ]:
by_comp.Person

In [ ]:
by_comp.max()

In [76]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

by_comp.describe()

In [77]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [78]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0,1,2,3])

In [79]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [96]:
df2 = pd.DataFrame({'AA': ['A4', 'A5', 'A6', 'A7'],
                    'BX': ['B4', 'B5', 'B6', 'B7'],
                    'CX': ['C4', 'C5', 'C6', 'C7'],
                    'DX': ['D4', 'D5', 'D6', 'D7']},
                   index=[4,5,6,7])

In [97]:
df3 = pd.DataFrame({'AA': ['A4', 'A9', 'A6', 'A11'],
                    'BY': ['B8', 'B9', 'B10', 'B11'],
                    'CY': ['C8', 'C9', 'C10', 'C11'],
                    'DY': ['D8', 'D9', 'D10', 'D11']},
                   index=[8,9,10,11])

In [84]:
df1
df2
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [85]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [86]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [89]:
df2.describe()

        AA  BX  CX  DX
count    4   4   4   4
unique   4   4   4   4
top     A6  B6  C6  D6
freq     1   1   1   1

In [90]:
df2

   AA  BX  CX  DX
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [91]:
df3

     AA   BY   CY   DY
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [98]:
pd.merge(df2, df3, how='outer', on=['AA'])

    AA   BX   CX   DX   BY   CY   DY
0   A4   B4   C4   D4   B8   C8   D8
1   A5   B5   C5   D5  NaN  NaN  NaN
2   A6   B6   C6   D6  B10  C10  D10
3   A7   B7   C7   D7  NaN  NaN  NaN
4   A9  NaN  NaN  NaN   B9   C9   D9
5  A11  NaN  NaN  NaN  B11  C11  D11

In [107]:
df2.join(df3,lsuffix='_l')

  AA_l  BX  CX  DX   AA   BY   CY   DY
4   A4  B4  C4  D4  NaN  NaN  NaN  NaN
5   A5  B5  C5  D5  NaN  NaN  NaN  NaN
6   A6  B6  C6  D6  NaN  NaN  NaN  NaN
7   A7  B7  C7  D7  NaN  NaN  NaN  NaN

In [102]:
df2['AA'].unique()

array(['A4', 'A5', 'A6', 'A7'], dtype=object)

In [103]:
df2['AA'].value_counts()

A6    1
A7    1
A4    1
A5    1
Name: AA, dtype: int64

In [104]:
def times2(x):
    return x*2

In [105]:
df2['AA'].apply(times2)

4    A4A4
5    A5A5
6    A6A6
7    A7A7
Name: AA, dtype: object

In [106]:
df2['AA'].apply(len)

4    2
5    2
6    2
7    2
Name: AA, dtype: int64

In [114]:
df = pd.read_csv('example')

In [115]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [117]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [120]:
df = pd.read_csv('u.user',delimiter='|')

In [121]:
df

       1  24  M     technician  85711
0      2  53  F          other  94043
1      3  23  M         writer  32067
2      4  24  M     technician  43537
3      5  33  F          other  15213
4      6  42  M      executive  98101
5      7  57  M  administrator  91344
6      8  36  M  administrator  05201
7      9  29  M        student  01002
8     10  53  M         lawyer  90703
9     11  39  F          other  30329
10    12  28  F          other  06405
11    13  47  M       educator  29206
12    14  45  M      scientist  55106
13    15  49  F       educator  97301
14    16  21  M  entertainment  10309
15    17  30  M     programmer  06355
16    18  35  F          other  37212
17    19  40  M      librarian  02138
18    20  42  F      homemaker  95660
19    21  26  M         writer  30068
20    22  25  M         writer  40206
21    23  30  F         artist  48197
22    24  21  F         artist  94533
23    25  39  M       engineer  55107
24    26  49  M       engineer  21044
25    27  40  F      librarian  30030
26    28  32  M         writer  55369
27    29  41  M     programmer  94043
28    30   7  M        student  55436
29    31  24  M         artist  10003
..   ...  .. ..            ...    ...
912  914  44  F          other  08105
913  915  50  M  entertainment  60614
914  916  27  M       engineer  N2L5N
915  917  22  F        student  20006
916  918  40  M      scientist  70116
917  919  25  M          other  14216
918  920  30  F         artist  90008
919  921  20  F        student  98801
920  922  29  F  administrator  21114
921  923  21  M        student  E2E3R
922  924  29  M          other  11753
923  925  18  F       salesman  49036
924  926  49  M  entertainment  01701
925  927  23  M     programmer  55428
926  928  21  M        student  55408
927  929  44  M      scientist  53711
928  930  28  F      scientist  07310
929  931  60  M       educator  33556
930  932  58  M       educator  06437
931  933  28  M        student  48105
932  934  61  M       engineer  22902
933  935  42  M         doctor  66221
934  936  24  M          other  32789
935  937  48  M       educator  98072
936  938  38  F     technician  55038
937  939  26  F        student  33319
938  940  32  M  administrator  02215
939  941  20  M        student  97229
940  942  48  F      librarian  78209
941  943  22  M        student  77841

[942 rows x 5 columns]

In [122]:
df.groupby('technician')

In [123]:
by_grp = df.groupby('technician')

In [124]:
by_grp

In [125]:
by_grp.describe()

                   1                                                        \
               count        mean         std    min     25%    50%     75%
technician
administrator   79.0  430.949367  281.302962    7.0  185.00  436.0  702.00
artist          28.0  451.892857  322.963860   23.0  149.00  421.5  823.75
doctor           7.0  533.714286  330.491913  138.0  275.00  427.0  843.00
educator        95.0  466.905263  250.727201   13.0  242.50  485.0  641.50
engineer        67.0  456.328358  261.663697   25.0  249.50  467.0  649.00
entertainment   18.0  398.000000  295.854098   16.0  153.50  381.0  537.25
executive       32.0  422.312500  287.533049    6.0  184.75  346.0  723.25
healthcare      16.0  501.437500  261.480393   60.0  343.25  563.5  688.50
homemaker        7.0  443.000000  345.112059   20.0  195.50  362.0  715.00
lawyer          12.0  359.083333  251.926562   10.0  152.25  352.0  480.25
librarian       51.0  486.588235  284.491207   19.0  230.00  527.0  705.50
marketing       26.0  437.807692  283.864900   46.0  154.75  469.5  664.00
none             9.0  368.666667  258.455025   57.0  130.00  289.0  628.00
other          105.0  542.733333  274.932938    2.0  346.00  597.0  766.00
programmer      66.0  435.530303  263.086603   17.0  203.75  417.5  660.25
retired         14.0  515.714286  235.690615  106.0  325.75  522.5  649.25
salesman        12.0  494.916667  252.383712  112.0  323.75  450.0  705.75
scientist       31.0  465.129032  299.837261   14.0  189.00  483.0  686.50
student        196.0  484.954082  261.435824    9.0  275.50  474.5  707.00
technician      26.0  516.730769  287.705760    4.0  298.25  516.5  738.75
writer          45.0  495.711111  269.192785    3.0  293.00  504.0  741.00

                         24                                                  \
                 max  count       mean        std   min    25%   50%    75%
technician
administrator  940.0   79.0  38.746835  11.123397  21.0  30.00  37.0  48.00
artist         920.0   28.0  31.392857   8.668116  19.0  25.00  30.0  39.00
doctor         935.0    7.0  43.571429  12.501428  28.0  35.50  45.0  48.50
educator       937.0   95.0  42.010526  10.413264  23.0  33.00  42.0  50.00
engineer       934.0   67.0  36.388060  11.199236  22.0  28.00  36.0  43.00
entertainment  926.0   18.0  29.222222  10.056052  15.0  23.00  25.0  33.00
executive      901.0   32.0  38.718750  10.608075  22.0  31.00  38.5  46.00
healthcare     910.0   16.0  41.562500  11.313524  22.0  30.50  44.5  49.25
homemaker      898.0    7.0  32.571429  10.737119  20.0  24.50  32.0  38.50
lawyer         846.0   12.0  36.750000  10.830303  21.0  28.75  34.0  47.75
librarian      942.0   51.0  40.000000  11.023611  23.0  30.00  39.0  49.00
marketing      881.0   26.0  37.615385   9.474500  24.0  30.25  36.0  42.50
none           756.0    9.0  26.555556  13.757826  11.0  16.00  26.0  33.00
other          936.0  105.0  34.523810  10.738227  13.0  26.00  32.0  44.00
programmer     927.0   66.0  33.121212   9.624512  20.0  27.00  30.0  38.00
retired        900.0   14.0  63.071429   5.757461  51.0  60.00  63.0  67.25
salesman       925.0   12.0  35.666667  14.079859  18.0  28.25  34.0  38.25
scientist      930.0   31.0  35.548387   7.392964  23.0  30.00  37.0  40.00
student        943.0  196.0  22.081633   5.284081   7.0  19.00  21.0  25.00
technician     938.0   26.0  33.500000   9.888377  21.0  24.50  31.0  41.00
writer         911.0   45.0  36.311111  11.423306  18.0  26.00  36.0  48.00


                max
technician
administrator  70.0
artist         48.0
doctor         64.0
educator       63.0
engineer       70.0
entertainment  50.0
executive      69.0
healthcare     62.0
homemaker      50.0
lawyer         53.0
librarian      69.0
marketing      55.0
none           55.0
other          64.0
programmer     63.0
retired        73.0
salesman       66.0
scientist      55.0
student        42.0
technician     55.0
writer         60.0

In [130]:
pd.to_csv(by_grp, 'usrgrp')

AttributeError: module 'pandas' has no attribute 'to_csv'